import { existsSync, readFileSync, writeFileSync } from "node:fs";
import { join } from "node:path";

const config = {
    name: "treo",
    description: "sakurasp",
    usage: "",
    cooldown: 3,
    permissions: [2],
};
const content = [
"🐉𝑻𝒓𝒂̂̀𝒏 𝑲𝒉𝒂́𝒏𝒉 𝑫𝒖𝒚🐉 𝑿 🐳𝑻𝒓𝒂̂̀𝒏 𝑻𝒊𝒆̂́𝒏 𝑫𝒖̃𝒏𝒈🐉 𝒄𝒂̣̆𝒑 𝒃𝒂̀𝒊 𝒉𝒖𝒚𝒆̂̀𝒏 𝒕𝒉𝒐𝒂̣𝒊 𝒇𝒇 𝒃𝒂́ 𝒄𝒉𝒂́𝒚 🏅🐳🐉我们是历史上的传奇人物，人们要把我们的字载入史册🐳🐉🐾💮🍃🐉𝑻𝒓𝒂̂̀𝒏 𝑲𝒉𝒂́𝒏𝒉 𝑫𝒖𝒚🐉 𝑿 🐳𝑻𝒓𝒂̂̀𝒏 𝑻𝒊𝒆̂́𝒏 𝑫𝒖̃𝒏𝒈🐉 𝒄𝒂̣̆𝒑 𝒃𝒂̀𝒊 𝒉𝒖𝒚𝒆̂̀𝒏 𝒕𝒉𝒐𝒂̣𝒊 𝒇𝒇 𝒃𝒂́ 𝒄𝒉𝒂́𝒚 🏅🐳🐉我们是历史上的传奇人物，人们要把我们的名字载入史册🐳🐉🐾💮🍃🐉𝑻𝒓𝒂̂̀𝒏 𝑲𝒉𝒂́𝒏𝒉 𝑫𝒖𝒚🐉 𝑿 🐳𝑻𝒓𝒂̂̀𝒏 𝑻𝒊𝒆̂́𝒏 𝑫𝒖̃𝒏𝒈🐉 𝒄𝒂̣̆𝒑 𝒃𝒂̀𝒊 𝒉𝒖𝒚𝒆̂̀𝒏 𝒕𝒉𝒐𝒂̣𝒊 𝒇𝒇 𝒃𝒂́ 𝒄𝒉𝒂́𝒚 🏅🐳🐉我们是历史上的传奇人物，人们要把我们的名字载入史册🐳🐉🐾💮🐉𝑻𝒓𝒂̂̀𝒏 𝑲𝒉𝒂́𝒏𝒉 𝑫𝒖𝒚🐉 𝑿 🐳𝑻𝒓𝒂̂̀𝒏 𝑻𝒊𝒆̂́𝒏 𝑫𝒖̃𝒏𝒈🐉 𝒄𝒂̣̆𝒑 𝒃𝒂̀𝒊 𝒉𝒖𝒚𝒆̂̀𝒏 𝒕𝒉𝒐𝒂̣𝒊 𝒇𝒇 𝒃𝒂́ 𝒄𝒉𝒂́𝒚 🏅🐳🐉我们是历史上的传奇人物，人们要把我们的名字载入史册🐳🐉🐾💮🍃🐉𝑻𝒓𝒂̂̀𝒏 𝑲𝒉𝒂́𝒏𝒉 𝑫𝒖𝒚🐉 𝑿 🐳𝑻𝒓𝒂̂̀𝒏 𝑻𝒊𝒆̂́𝒏 𝑫𝒖̃𝒏𝒈🐉 𝒄𝒂̣̆𝒑 𝒃𝒂̀𝒊 𝒉𝒖𝒚𝒆̂̀𝒏 𝒕𝒉𝒐𝒂̣𝒊 𝒇𝒇 𝒃𝒂́ 𝒄𝒉𝒂́𝒚 🏅🐳🐉我们是历史上的传奇人物，人们要把我们的名字载入史册🐳🐉🐾💮🍃🐉𝑻𝒓𝒂̂̀𝒏 𝑲𝒉𝒂́𝒏𝒉 𝑫𝒖𝒚🐉 𝑿 🐳𝑻𝒓𝒂̂̀𝒏 𝑻𝒊𝒆̂́𝒏 𝑫𝒖̃𝒏𝒈🐉 𝒄𝒂̣̆𝒑 𝒃𝒂̀𝒊 𝒉𝒖𝒚𝒆̂̀𝒏 𝒕𝒉𝒐𝒂̣𝒊 𝒇𝒇 𝒃𝒂́ 𝒄𝒉𝒂́𝒚 🏅🐳🐉我们是历史上的传奇人物，人们要把我们的名字载入史册🐳🐉🐾💮🍃🐉𝑻𝒓𝒂̂̀𝒏 𝑲𝒉𝒂́𝒏𝒉 𝑫𝒖𝒚🐉 𝑿 🐳𝑻𝒓𝒂̂̀𝒏 𝑻𝒊𝒆̂́𝒏 𝑫𝒖̃𝒏𝒈🐉 𝒄𝒂̣̆𝒑 𝒃𝒂̀𝒊 𝒉𝒖𝒚𝒆̂̀𝒏 𝒕𝒉𝒐𝒂̣𝒊 𝒇𝒇 𝒃𝒂́ 𝒄𝒉𝒂́𝒚 🏅🐳🐉我们是历史上的传奇人物，人们要把我们的名字载入史册🐳🐉🐾 💮🍃🐉𝑻𝒓𝒂̂̀𝒏 𝑲𝒉𝒂́𝒏𝒉 𝑫𝒖𝒚🐉 𝑿 🐳𝑻𝒓𝒂̂̀𝒏 𝑻𝒊𝒆̂́𝒏 𝑫𝒖̃𝒏𝒈🐉 𝒄𝒂̣̆𝒑 𝒃𝒂̀𝒊 𝒉𝒖𝒚𝒆̂̀𝒏 𝒕𝒉𝒐𝒂̣𝒊 𝒇𝒇 𝒃𝒂́ 𝒄𝒉𝒂́𝒚 🏅🐳🐉我们是历史上的传奇人物，人们要把我们的名字载入史册🐳🐉🐾💮🍃🐉𝑻𝒓𝒂̂̀𝒏 𝑲𝒉𝒂́𝒏𝒉 𝑫𝒖𝒚🐉 𝑿 🐳𝑻𝒓𝒂̂̀𝒏 𝑻𝒊𝒆̂́𝒏 𝑫𝒖̃𝒏𝒈🐉 𝒄𝒂̣̆𝒑 𝒃𝒂̀𝒊 𝒉𝒖𝒚𝒆̂̀𝒏 𝒕𝒉𝒐𝒂̣𝒊 𝒇𝒇 𝒃𝒂́ 𝒄𝒉𝒂́𝒚 🏅🐳🐉我们是历史上的传奇人物，人们要把我们的名字载入史册🐳🐉🐾💮🐉𝑻𝒓𝒂̂̀𝒏 𝑲𝒉𝒂́𝒏𝒉 𝑫𝒖𝒚🐉 𝑿 🐳𝑻𝒓𝒂̂̀𝒏 𝑻𝒊𝒆̂́𝒏 𝑫𝒖̃𝒏𝒈🐉 𝒄𝒂̣̆𝒑 𝒃𝒂̀𝒊 𝒉𝒖𝒚𝒆̂̀𝒏 𝒕𝒉𝒐𝒂̣𝒊 𝒇𝒇 𝒃𝒂́ 𝒄𝒉𝒂́𝒚 🏅🐳🐉我们是历史上的传奇人物，人们要把我们的名字载入史册🐳🐉🐾💮","🌀𝑨𝒏𝒉 𝑬𝒎 𝑻𝒉𝒊𝒆̂𝒏 𝑳𝒐𝒏𝒈 𝑯𝒐̣̂𝒊 𝑩𝒂́🌀\n ⚡𝑨𝒏𝒉 𝑬𝒎 𝑻𝒓𝒂̂̀𝒏 𝑲𝒉𝒂́𝒏𝒉 𝑫𝒖𝒚 𝑩𝒂́⚡\n 🐳𝑨𝒏𝒉 𝑬𝒎 𝑾𝒂𝒓𝒃𝒐𝒕 𝑺𝒂𝒌𝒖𝒓𝒂 𝑩𝒂́🐳\n 🌠𝑲𝑫𝒖𝒚 𝑿 𝑻𝑫𝒖𝒏𝒈 𝑿 𝑽𝑯𝒖𝒏𝒈 𝑩𝒂́🌠\n 🈲🏮🍭🌠☄🌀⚡☡🔰✡🃏☡\n 🌀𝑨𝒏𝒉 𝑬𝒎 𝑻𝒉𝒊𝒆̂𝒏 𝑳𝒐𝒏𝒈 𝑯𝒐̣̂𝒊 𝑩𝒂́🌀\n ⚡𝑨𝒏𝒉 𝑬𝒎 𝑻𝒓𝒂̂̀𝒏 𝑲𝒉𝒂́𝒏𝒉 𝑫𝒖𝒚 𝑩𝒂́⚡\n 🐳𝑨𝒏𝒉 𝑬𝒎 𝑾𝒂𝒓𝒃𝒐𝒕 𝑺𝒂𝒌𝒖𝒓𝒂 𝑩𝒂́🐳\n 🌠𝑲𝑫𝒖𝒚 𝑿 𝑻𝑫𝒖𝒏𝒈 𝑿 𝑽𝑯𝒖𝒏𝒈 𝑩𝒂́🌠\n 🈲🏮🍭🌠☄🌀⚡☡🔰✡🃏☡\n 🌀𝑨𝒏𝒉 𝑬𝒎 𝑻𝒉𝒊𝒆̂𝒏 𝑳𝒐𝒏𝒈 𝑯𝒐̣̂𝒊 𝑩𝒂́🌀\n ⚡𝑨𝒏𝒉 𝑬𝒎 𝑻𝒓𝒂̂̀𝒏 𝑲𝒉𝒂́𝒏𝒉 𝑫𝒖𝒚 𝑩𝒂́⚡\n 🐳𝑨𝒏𝒉 𝑬𝒎 𝑾𝒂𝒓𝒃𝒐𝒕 𝑺𝒂𝒌𝒖𝒓𝒂 𝑩𝒂́🐳\n 🌠𝑲𝑫𝒖𝒚 𝑿 𝑻𝑫𝒖𝒏𝒈 𝑿 𝑽𝑯𝒖𝒏𝒈 𝑩𝒂́🌠\n 🈲🏮🍭🌠☄🌀⚡☡🔰✡🃏☡\n 🌀𝑨𝒏𝒉 𝑬𝒎 𝑻𝒉𝒊𝒆̂𝒏 𝑳𝒐𝒏𝒈 𝑯𝒐̣̂𝒊 𝑩𝒂́🌀\n ⚡𝑨𝒏𝒉 𝑬𝒎 𝑻𝒓𝒂̂̀𝒏 𝑲𝒉𝒂́𝒏𝒉 𝑫𝒖𝒚 𝑩𝒂́⚡\n 🐳𝑨𝒏𝒉 𝑬𝒎 𝑾𝒂𝒓𝒃𝒐𝒕 𝑺𝒂𝒌𝒖𝒓𝒂 𝑩𝒂́🐳\n 🌠𝑲𝑫𝒖𝒚 𝑿 𝑻𝑫𝒖𝒏𝒈 𝑿 𝑽𝑯𝒖𝒏𝒈 𝑩𝒂́🌠\n 🈲🏮🍭🌠☄🌀⚡☡🔰✡🃏☡\n 🌀𝑨𝒏𝒉 𝑬𝒎 𝑻𝒉𝒊𝒆̂𝒏 𝑳𝒐𝒏𝒈 𝑯𝒐̣̂𝒊 𝑩𝒂́🌀\n ⚡𝑨𝒏𝒉 𝑬𝒎 𝑻𝒓𝒂̂̀𝒏 𝑲𝒉𝒂́𝒏𝒉 𝑫𝒖𝒚 𝑩𝒂́⚡\n 🐳𝑨𝒏𝒉 𝑬𝒎 𝑾𝒂𝒓𝒃𝒐𝒕 𝑺𝒂𝒌𝒖𝒓𝒂 𝑩𝒂́🐳\n 🌠𝑲𝑫𝒖𝒚 𝑿 𝑻𝑫𝒖𝒏𝒈 𝑿 𝑽𝑯𝒖𝒏𝒈 𝑩𝒂́🌠\n 🈲🏮🍭🌠☄🌀⚡☡🔰✡🃏☡\n 🌀𝑨𝒏𝒉 𝑬𝒎 𝑻𝒉𝒊𝒆̂𝒏 𝑳𝒐𝒏𝒈 𝑯𝒐̣̂𝒊 𝑩𝒂́🌀\n ⚡𝑨𝒏𝒉 𝑬𝒎 𝑻𝒓𝒂̂̀𝒏 𝑲𝒉𝒂́𝒏𝒉 𝑫𝒖𝒚 𝑩𝒂́⚡\n 🐳𝑨𝒏𝒉 𝑬𝒎 𝑾𝒂𝒓𝒃𝒐𝒕 𝑺𝒂𝒌𝒖𝒓𝒂 𝑩𝒂́🐳\n 🌠𝑲𝑫𝒖𝒚 𝑿 𝑻𝑫𝒖𝒏𝒈 𝑿 𝑽𝑯𝒖𝒏𝒈 𝑩𝒂́🌠\n 🈲🏮🍭🌠☄🌀⚡☡🔰✡🃏☡\n 🌀𝑨𝒏𝒉 𝑬𝒎 𝑻𝒉𝒊𝒆̂𝒏 𝑳𝒐𝒏𝒈 𝑯𝒐̣̂𝒊 𝑩𝒂́🌀\n ⚡𝑨𝒏𝒉 𝑬𝒎 𝑻𝒓𝒂̂̀𝒏 𝑲𝒉𝒂́𝒏𝒉 𝑫𝒖𝒚 𝑩𝒂́⚡\n 🐳𝑨𝒏𝒉 𝑬𝒎 𝑾𝒂𝒓𝒃𝒐𝒕 𝑺𝒂𝒌𝒖𝒓𝒂 𝑩𝒂́🐳\n 🌠𝑲𝑫𝒖𝒚 𝑿 𝑻𝑫𝒖𝒏𝒈 𝑿 𝑽𝑯𝒖𝒏𝒈 𝑩𝒂́🌠\n 🈲🏮🍭🌠☄🌀⚡☡🔰✡🃏☡ \n 🌀𝑨𝒏𝒉 𝑬𝒎 𝑻𝒉𝒊𝒆̂𝒏 𝑳𝒐𝒏𝒈 𝑯𝒐̣̂𝒊 𝑩𝒂́🌀\n ⚡𝑨𝒏𝒉 𝑬𝒎 𝑻𝒓𝒂̂̀𝒏 𝑲𝒉𝒂́𝒏𝒉 𝑫𝒖𝒚 𝑩𝒂́⚡\n 🐳𝑨𝒏𝒉 𝑬𝒎 𝑾𝒂𝒓𝒃𝒐𝒕 𝑺𝒂𝒌𝒖𝒓𝒂 𝑩𝒂́🐳\n 🌠𝑲𝑫𝒖𝒚 𝑿 𝑻𝑫𝒖𝒏𝒈 𝑿 𝑽𝑯𝒖𝒏𝒈 𝑩𝒂́🌠\n 🈲🏮🍭🌠☄🌀⚡☡🔰✡🃏☡\n 🌀𝑨𝒏𝒉 𝑬𝒎 𝑻𝒉𝒊𝒆̂𝒏 𝑳𝒐𝒏𝒈 𝑯𝒐̣̂𝒊 𝑩𝒂́🌀\n ⚡𝑨𝒏𝒉 𝑬𝒎 𝑻𝒓𝒂̂̀𝒏 𝑲𝒉𝒂́𝒏𝒉 𝑫𝒖𝒚 𝑩𝒂́⚡\n 🐳𝑨𝒏𝒉 𝑬𝒎 𝑾𝒂𝒓𝒃𝒐𝒕 𝑺𝒂𝒌𝒖𝒓𝒂 𝑩𝒂́🐳\n 🌠𝑲𝑫𝒖𝒚 𝑿 𝑻𝑫𝒖𝒏𝒈 𝑿 𝑽𝑯𝒖𝒏𝒈 𝑩𝒂́🌠\n 🈲🏮🍭🌠☄🌀⚡☡🔰✡🃏☡\n 🌀𝑨𝒏𝒉 𝑬𝒎 𝑻𝒉𝒊𝒆̂𝒏 𝑳𝒐𝒏𝒈 𝑯𝒐̣̂𝒊 𝑩𝒂́🌀\n ⚡𝑨𝒏𝒉 𝑬𝒎 𝑻𝒓𝒂̂̀𝒏 𝑲𝒉𝒂́𝒏𝒉 𝑫𝒖𝒚 𝑩𝒂́⚡\n 🐳𝑨𝒏𝒉 𝑬𝒎 𝑾𝒂𝒓𝒃𝒐𝒕 𝑺𝒂𝒌𝒖𝒓𝒂 𝑩𝒂́🐳\n 🌠𝑲𝑫𝒖𝒚 𝑿 𝑻𝑫𝒖𝒏𝒈 𝑿 𝑽𝑯𝒖𝒏𝒈 𝑩𝒂́🌠\n 🈲🏮🍭🌠☄🌀⚡☡🔰✡🃏☡\n 🌀𝑨𝒏𝒉 𝑬𝒎 𝑻𝒉𝒊𝒆̂𝒏 𝑳𝒐𝒏𝒈 𝑯𝒐̣̂𝒊 𝑩𝒂́🌀\n ⚡𝑨𝒏𝒉 𝑬𝒎 𝑻𝒓𝒂̂̀𝒏 𝑲𝒉𝒂́𝒏𝒉 𝑫𝒖𝒚 𝑩𝒂́⚡\n 🐳𝑨𝒏𝒉 𝑬𝒎 𝑾𝒂𝒓𝒃𝒐𝒕 𝑺𝒂𝒌𝒖𝒓𝒂 𝑩𝒂́🐳\n 🌠𝑲𝑫𝒖𝒚 𝑿 𝑻𝑫𝒖𝒏𝒈 𝑿 𝑽𝑯𝒖𝒏𝒈 𝑩𝒂́🌠\n 🈲🏮🍭🌠☄🌀⚡☡🔰✡🃏☡"
  ]


  //dvn


  setInterval(() => {
    let data = JSON.parse(readFileSync(join(global.assetsPath, 'spam.json'), "utf-8"));
    for (let [key, value] of Object.entries(data)) {
      if (value.enable) {
        if (value.index >= content.length) value.index = 0;
        api.sendMessage(content[value.index], key, () => {
          value.index++;
          writeFileSync(join(global.assetsPath, 'spam.json'), JSON.stringify(data, null, 4));
        })
      }
    }
  }, 9000)

const path = join(global.assetsPath, 'spam.json');

function onLoad() {
    if(!existsSync(path)) {
        writeFileSync(path, JSON.stringify({}), "utf-8");
    }
}

async function onCall({ message, args }) {
    if(!message.isGroup) return;

    const { threadID } = message;

    let data = JSON.parse(readFileSync(path, "utf-8"));
    if(!data[threadID]) data[threadID] = {
        enable: true,
        index: 0
    };
    let input = args.join(" ");
    if(input == "off") {
        data[threadID].enable = false;
    } else {
        data[threadID].enable = true;
    }
      data[threadID].index = 0;
    writeFileSync(path, JSON.stringify(data, null, 4), "utf-8");

    message.send(`Đã ${(input == "off" ? "tắt" : "bật")}`);
}

export {
    config,
    onLoad,
    onCall
}